Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.QueryReturnValue Property
 Status information about the latest database operation (select, insert, modify, delete).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReturnValuesEnum QueryReturnValue { get; set; }
Public Property QueryReturnValue As ReturnValuesEnum
	Get
	Set
Property Value
Type: ReturnValuesEnum
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace